In [7]:
import pandas as pd
import numpy as np

In [8]:
people = {
	"id": [1,2,3,4,5],
	"name": ["Surin", "Precha", "Nonthakarn", "Araya", "Jindarat"],
	"subject": ["Math", "P.E.", "Art", "Chemistry", "Chinese"]
}

school = {
	"id": [1,2,3,4,5],
	"school_name": ["Barry International School", "Ban Muang School of Libetarian", "Special Institute of Data Science", "Prayuthland College", "Defense Yourself from Proverty Academy"],
	"province": ["Bangkok", "Nonthaburi", "Korat", "Yala", "Chiangrai"]
}

In [9]:
people_data = pd.DataFrame(people)
school_data = pd.DataFrame(school)

In [10]:
school_data

   id                             school_name    province
0   1              Barry International School     Bangkok
1   2          Ban Muang School of Libetarian  Nonthaburi
2   3       Special Institute of Data Science       Korat
3   4                     Prayuthland College        Yala
4   5  Defense Yourself from Proverty Academy   Chiangrai

In [11]:
student_data = pd.merge(people_data, school_data, on="id")
student_data

,id,name,subject,school_name,province
0,1,Surin,Math,Barry International School,Bangkok
1,2,Precha,P.E.,Ban Muang School of Libetarian,Nonthaburi
2,3,Nonthakarn,Art,Special Institute of Data Science,Korat
3,4,Araya,Chemistry,Prayuthland College,Yala
4,5,Jindarat,Chinese,Defense Yourself from Proverty Academy,Chiangrai

In [12]:
student_data.columns = ["ID", "Name", "Favorite Subject", "School Name", "Province"]
student_data

,ID,Name,Favorite Subject,School Name,Province
0,1,Surin,Math,Barry International School,Bangkok
1,2,Precha,P.E.,Ban Muang School of Libetarian,Nonthaburi
2,3,Nonthakarn,Art,Special Institute of Data Science,Korat
3,4,Araya,Chemistry,Prayuthland College,Yala
4,5,Jindarat,Chinese,Defense Yourself from Proverty Academy,Chiangrai

In [14]:
student_data.to_csv("Mocking_Student.csv")